app/views/pages/home.html.erb

        <p class="subtext">
          <span class="upvote-holder"><%= post.votes_for.size %></span> points by <a href="#"><%= post.user.username %></a> <%= time_ago_in_words(post.created_at) %> |
          <a href="#"><%= post.comments.size %> comments</p></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 501]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5998]]