app/views/posts/show.html.erb

    <p class="subtext">
      <span class="upvote-holder"><%= @post.votes_for.size %></span> points by <a href="#"><%= @post.user.username %></a> <%= time_ago_in_words(@post.created_at) %> |
      <a href="#"><%= @post.comments.size %> comments</p></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 496]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY created_at DESC  [["post_id", 5978]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."comment_id" = $1  [["comment_id", 135051]]