app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    @comments = Comment.all

INSERT INTO "comments" ("comment_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_id", 140205], ["user_id", 503], ["body", "Nice comment"], ["created_at", "2015-06-19 15:47:19.245830"], ["updated_at", "2015-06-19 15:47:19.245830"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save