app/controllers/pages_controller.rb

  def home
    @posts = Post.paginate(page: params[:page], :per_page => 30).order('created_at DESC')
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"