app/controllers/posts_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY created_at DESC  [["post_id", 6000]]
---
  def show
    @comment = @post.comments.build
    @nested_comment = Comment.new
    @comments = @post.comments.all.order("created_at DESC")